Repository: zachvoxwatt/Ez-Book-Zach-variant
Catalog: lib/src/localization/app_*.arb
Languages: vi

# tab_home
source: Home
vi: Trang chủ

# tab_ftb
source: Featured Books
vi: Sách đặc trưng

# tab_reminder
source: Reminder
vi: Ghi nhớ

# tab_user
source: User
vi: Người dùng

# tab_misc
source: Miscellaneous
vi: Đa dạng

# home_search
source: Search movie here...
vi: Tìm tên sách...

# home_recommend
source: Recommended Books
vi: Sách dành cho bạn

# home_viewall
source: View All
vi: Xem tất cả

# home_trending
source: Trending Books
vi: Sách xu hướng

# ftb_tip
source: TIP: Pull this section down to refresh the listings!
vi: Gợi ý: Kéo xuống để làm mới danh sách!

# ftb_book_genre
source: Genre
vi: Thể loại

# ftb_poll_polling
source: Fetching...
vi: Đang lấy dữ liệu...

# ftb_poll_success
source: Success!
vi: Thành công!

# ftb_poll_retry
source: Try again
vi: Thử lại

# ftb_poll_err_forbidden
source: ❌ Access Denied ❌ Insufficient permission
vi: ❌ Truy cập bị từ chối ❌ Không đủ quyền để thực hiện hành động

# ftb_poll_err_unreachable
source: ❌ Could not reach the service ❌
vi: ❌ Không thể liên lạc với dịch vụ ❌

# readview_add_to_lib
source: Add To Library
vi: Thêm vào tủ

# readview_read_now
source: Read Now
vi: Đọc ngay

# readview_viewcount
source: Read(s)
vi: Lượt xem

# user_signin_button
source: Sign In
vi: Đăng nhập

# user_signin_username_label
source: Username
vi: Tài khoản

# user_signin_password_label
source: Password
vi: Mật khẩu

# user_signin_signin_button_label
source: Sign In
vi: Đăng nhập

# user_signin_back_button_label
source: Back
vi: Trở về

# user_signin_reg_alt1
source: Don't have an account yet?
vi: Bạn chưa có tài khoản?

# user_signin_reg_alt2
source: Register here!
vi: Đăng ký tại đây!

# user_signin_err_neg1
source: Could not reach the service. Please try again later!
vi: Không thể kết nối với máy chủ. Vui lòng thử lại sau!

# user_signin_err_101
source: Invalid username / password
vi: Sai tài khoản / mật khẩu

# user_signin_err_200
source: Username is required
vi: Bắt buộc phải có tài khoản

# user_signin_err_201
source: Password is required
vi: Bắt buộc phải có mật khẩu

# user_signedin_info_label
source: Your credentials information (tap to select and change your credentials):
vi: Thông tin cá nhân của bạn (nhấn vào để chọn và thay đổi thông tin):

# user_signedin_username_label
source: Username
vi: Tài khoản

# user_signedin_password_label
source: Password
vi: Mật khẩu

# user_signedin_displayname_label
source: Display name
vi: Tên hiển thị

# user_signedin_phone_label
source: Phone
vi: Số điện thoại

# user_signedin_token_tip
source: Session Token ID (DO NOT share this with anyone but a certified staff member!):
vi: Mã định dạng Token app (đừng chia sẻ thông tin này cho ai khác ngoài những người có phận sự!):

# user_signedin_delete_option
source: Purge account
vi: Xóa tài khoản

# user_signedin_edit_label_prefix
source: Edit
vi: Chỉnh sửa

# user_signedin_edit_err_typo
source: An error occurred. This is mainly caused by one of the following typos: • Blank spaces • Special characters (non-alphanumeric) • Incorrect input format Please check again and retry!
vi: Đã có lỗi xảy ra. Khả năng cao là một trong những lỗi đánh chữ sau đây: • Các khoảng trống • Những kí tự đặc biệt (không thuộc chữ cái Latin và các số tự nhiên cơ bản) • Dữ liệu được nhập vô miền không đúng định dạng Vui lòng hãy kiểm tra và thử lại!

# user_signedin_edit_err_sameinfo
source: • New value of this field can not be the current active value! • No changes were made
vi: • Giá trị mới của miền này giống với giá trị đang hiện hữu! • Không có sửa đổi nào được thực hiện

# user_signedin_delete_err
source: An error occurred while trying to delete your account. Please try again later!
vi: Đã có lỗi xảy ra trong khi xóa tài khoản của bạn. Vui lòng thử lại sau!

# user_signedin_delete_dialog_label
source: Purging account
vi: Xóa tài khoản

# user_signedin_delete_dialog_warn1
source: Are you sure about this?
vi: Bạn có chắc chứ?

# user_signedin_delete_dialog_warn2
source: This action can not be undone!
vi: Hành động này không thể được khôi phục!

# user_signedin_delete_button1_label
source: Proceed
vi: Tiếp tục

# user_signedin_delete_button2_label
source: Back
vi: Trở về

# user_update_err_neg1
source: Could not reach the service. Please try again later!
vi: Không thể kết nối với máy chủ. Vui lòng thử lại sau!

# user_update_err_202
source: Account already exists for this username!
vi: Tên tài khoản này đang có người sử dụng!

# user_signout_wait
source: Signing out. Please wait...
vi: Đang đăng xuất. Xin chờ giây lát...

# user_signout_msg
source: You have signed out
vi: Bạn đã đăng xuất

# user_signout_deleted_pending
source: Signing you out and deleting your account...
vi: Đang đăng xuất và xóa tài khoản của bạn...

# user_signout_deleted_msg
source: Your account has been deleted
vi: Tài khoản của bạn đã bị xóa

# user_signout_button
source: Sign Out
vi: Đăng xuất

# user_reg_button
source: Register
vi: Đăng ký

# user_reg_cancel_button
source: Cancel
vi: Hủy

# user_reg_success
source: Successfully registered! Please sign in to continue
vi: Đăng ký thành công! Vui lòng đăng nhập để tiếp tục

# user_reg_username_label
source: Username
vi: Tài khoản

# user_reg_password_label
source: Password
vi: Mật khẩu

# user_reg_displayname_label
source: Display name
vi: Tên hiển thị

# user_reg_phone_label
source: Phone number (OPTIONAL)
vi: Số điện thoại (KHÔNG BẮT BUỘC)

# user_reg_alt_signin_1
source: Got an account?
vi: Bạn đã có tài khoản?

# user_reg_alt_signin_2
source: Sign in here!
vi: Đăng nhập tại đây!

# user_reg_err_username_length
source: Username is too long or too short! It should be in between 6 - 30 characters.
vi: Tài khoản quá dài hoặc quá ngắn! Dữ liệu hợp lệ phải trong khoảng từ 6 - 30 kí tự!

# user_reg_err_username_regexp
source: Username contains prohibited special characters or spaces! It should only enclose alphanumeric characters, underscores and dots!
vi: Tài khoản có chứa những kí tự đặc biệt không hợp lệ hoặc khoảng trống! Dữ liệu hợp lệ chứa các chữ cái Latin, 10 số tự nhiên cơ bản, dấu gạch dưới và dấu chấm

# user_reg_err_username_nodata
source: No input given in the Username field
vi: Không có dữ liệu nhập vào ở miền Tài khoản

# user_reg_err_password_length
source: Password is too short! It should be more than or equal to 6 characters!
vi: Mật khẩu quá ngắn! Dữ liệu hợp lệ phải từ 6 kí tự trở đi!

# user_reg_err_password_regexp
source: Password contains prohibited special characters or spaces! It should only enclose alphanumeric characters, underscores and dots!
vi: Mật khẩu có chứa những kí tự đặc biệt không hợp lệ hoặc khoảng trống! Dữ liệu hợp lệ chứa các chữ cái Latin, 10 số tự nhiên cơ bản, dấu gạch dưới và dấu chấm

# user_reg_err_password_nodata
source: No input given in the Password field
vi: Không có dữ liệu nhập vào ở miền Mật khẩu

# user_reg_err_phone_foulformat
source: Phone number does not match general form or has spaces! It should only contain digits and / or a plus (+) sign at the start!
vi: Số điện thoại không trùng khớp với định dạng hoặc có khoảng trống! Dữ liệu hợp lệ chứa 10 số tự nhiên cơ bản và / hoặc dấu (+) ở đầu số!

# user_reg_err_displayname_nodata
source: No input given in the Display Name field
vi: Không có dữ liệu nhập vào ở miền Tên hiển thị

# user_reg_err_neg1
source: Could not reach the service. Please try again later!
vi: Không thể kết nối với máy chủ. Vui lòng thử lại sau!

# user_reg_err_200
source: Bad or missing username. Please try again
vi: Tài khoản không hợp lệ hoặc bị lỗi. Vui lòng hãy thử lại

# user_reg_err_201
source: Password is required. Please try again
vi: Mật khẩu bắt buộc phải có. Vui lòng hãy thử lại

# user_reg_err_202
source: Account already exists for this username. Please try again
vi: Tài khoản đang tồn tại. Vui lòng hãy thử Tài khoản khác

# settings_title
source: Settings
vi: Cài đặt

# settings_font
source: Font
vi: Font chữ

# settings_fontsize
source: Font size
vi: Kích cỡ

# settings_darktheme
source: Dark theme
vi: Tối

# settings_lighttheme
source: Light theme
vi: Sáng

# settings_confirm
source: Done
vi: Hoàn tất

# misc_apptheme
source: App Theme
vi: Giao diện

# misc_apptheme_change_dark
source: Application is now in Dark mode
vi: Ứng dụng đã chuyển sang chế độ Tối

# misc_apptheme_change_light
source: Application is now in Light mode
vi: Ứng dụng đã chuyển sang chế độ Sáng

# misc_lang_change
source: Language applied successfully
vi: Thay đổi ngôn ngữ thành công

# misc_font_settings
source: Font Settings
vi: Cài đặt Font

# misc_font_settings_button
source: Change
vi: Thay đổi

# misc_font_settings_changed
source: Changes applied!
vi: Đã áp dụng các sửa đổi!

# misc_lang
source: Language
vi: Ngôn ngữ

# reminder_signedout_info
source: There is nothing here... Sign In to view!
vi: Không có gì ở đây... Đăng nhập để xem!

# reminder_signedin_no_reminder
source: You have none! Tap the 'Add' button to create!
vi: Bạn không có ghi nhớ nào! Dùng nút 'Tạo' để thêm!

# reminder_dialog_label
source: Add a Reminder
vi: Tạo ghi nhớ mới

# reminder_dialog_field_content
source: Content (OPTIONAL)
vi: Nội dung (TÙY CHỌN)

# reminder_dialog_field_time
source: Finish Time (OPTIONAL)
vi: Thời gian hoàn tất (TÙY CHỌN)

# reminder_dialog_button_create
source: Create
vi: Tạo mới

# reminder_dialog_button_cancel
source: Cancel
vi: Hủy bỏ

# reminder_dialog_error_connection
source: An error occurred while trying to add reminder. Reason: Could not reach the service!
vi: Đã có lỗi xảy ra khi tạo mới ghi nhớ. Nguyên nhân: Không thể liên lạc tới máy chủ!

# reminder_dialog_create_success
source: Reminder created!
vi: Ghi nhớ đã được tạo!

# reminder_dialog_create_dismiss
source: Dismiss
vi: Bỏ qua

# reminder_dialog_edit_label
source: Edit Reminder
vi: Sửa đổi ghi nhớ

# reminder_edit_dialog_finished_label
source: Finished
vi: Đã hoàn thành

# reminder_edit_dialog_update_label
source: Update
vi: Cập nhật

# reminder_edit_dialog_delete_label
source: Delete Reminder
vi: Xóa ghi nhớ

# reminder_dialog_edit_success_label
source: Reminder updated
vi: Đã cập nhật ghi nhớ

# reminder_edit_dialog_dismiss_label
source: Dismiss
vi: Bỏ qua

# reminder_edit_dialog_deleted_message
source: Reminder deleted
vi: Đã xóa ghi nhớ

# reminder_card_default_content
source: A humble reminder to encourage you to read some books 🙂
vi: Một ghi nhớ khiêm tốn để động viên bạn đọc vài cuốn sách 🙂
